andre1012345/STM32N6-digits-recognition/Application/Src/main.c
 /**
 ******************************************************************************
 * @file    main.c
 * @author  GPM Application Team
 *
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
#include <string.h>
#include <unistd.h>

#include "cmw_camera.h"
#include "stm32n6570_discovery_bus.h"
#include "stm32n6570_discovery_lcd.h"
#include "stm32n6570_discovery_xspi.h"
#include "stm32n6570_discovery.h"
#include "stm32_lcd.h"
#include "app_fuseprogramming.h"
#include "stm32_lcd_ex.h"
#include "stai.h"
#include "stai_network.h"
#include "app_camerapipeline.h"
#include "main.h"
#include <stdio.h>
#include "app_config.h"
#include "crop_img.h"
#include "stlogo.h"
#include "arm_math.h"

#define TEST_MODE 0  /* 0 = live camera, 1 = synthetic digit cycling */
#if TEST_MODE
#include "digits.h"
#define DIGIT_HOLD_MS 3000  /* ms to hold each digit before advancing */
#endif

CLASSES_TABLE;

#define LCD_FG_WIDTH  SCREEN_WIDTH
#define LCD_FG_HEIGHT SCREEN_HEIGHT
#define LCD_FG_FRAMEBUFFER_SIZE  (LCD_FG_WIDTH * LCD_FG_HEIGHT * 2)

#ifndef APP_GIT_SHA1_STRING
#define APP_GIT_SHA1_STRING "dev"
#endif
#ifndef APP_VERSION_STRING
#define APP_VERSION_STRING "unversioned"
#endif


typedef struct
{
  uint32_t X0;
  uint32_t Y0;
  uint32_t XSize;
  uint32_t YSize;
} Rectangle_TypeDef;

/* Lcd Background area */
Rectangle_TypeDef lcd_bg_area = {
#if ASPECT_RATIO_MODE == ASPECT_RATIO_CROP || ASPECT_RATIO_MODE == ASPECT_RATIO_FIT
  .X0 = (LCD_FG_WIDTH - LCD_FG_HEIGHT) / 2,
#else
  .X0 = 0,
#endif
  .Y0 = 0,
  .XSize = 0,
  .YSize = 0,
};

/* Lcd Foreground area */
Rectangle_TypeDef lcd_fg_area = {
  .X0 = 0,
  .Y0 = 0,
  .XSize = LCD_FG_WIDTH,
  .YSize = LCD_FG_HEIGHT,
};

UART_HandleTypeDef huart1;
volatile int32_t cameraFrameReceived;
stai_ptr nn_in;
BSP_LCD_LayerConfig_t LayerConfig = {0};
void *pp_input;
char const *nn_top1_output_class_name;
float nn_top1_output_class_proba;
int nn_ranking[NB_CLASSES];
static float nn_out_float[NB_CLASSES];

#define ALIGN_TO_16(value) (((value) + 15) & ~15)

/* When NN input dimensions are not a multiple of 16, the DCMIPP output needs cropping */
#if (STAI_NETWORK_IN_1_WIDTH * STAI_NETWORK_IN_1_CHANNEL) != ALIGN_TO_16(STAI_NETWORK_IN_1_WIDTH * STAI_NETWORK_IN_1_CHANNEL)
#define DCMIPP_NN_NEEDS_CROP 1
#define DCMIPP_OUT_NN_LEN (ALIGN_TO_16(STAI_NETWORK_IN_1_WIDTH * STAI_NETWORK_IN_1_CHANNEL) * STAI_NETWORK_IN_1_HEIGHT)
#define DCMIPP_OUT_NN_BUFF_LEN (DCMIPP_OUT_NN_LEN + 32 - DCMIPP_OUT_NN_LEN%32)

__attribute__ ((aligned (32)))
static uint8_t dcmipp_out_nn[DCMIPP_OUT_NN_BUFF_LEN];
#else
#define DCMIPP_NN_NEEDS_CROP 0
#endif

/* Intermediate uint8 capture buffer: DCMIPP always writes uint8 RGB888 here;
   a software step converts it to float32 in nn_in before inference. */
#define NN_RAW_BUF_SIZE (STAI_NETWORK_IN_1_WIDTH * STAI_NETWORK_IN_1_HEIGHT * 3)
__attribute__((aligned(32)))
static uint8_t nn_raw[NN_RAW_BUF_SIZE];

/* model */
STAI_NETWORK_CONTEXT_DECLARE(network_context, STAI_NETWORK_CONTEXT_SIZE)
/* Lcd Background Buffer */
__attribute__ ((section (".psram_bss")))
__attribute__ ((aligned (32)))
static uint8_t lcd_bg_buffer[800 * 480 * 2];
/* Lcd Foreground Buffer */
__attribute__ ((section (".psram_bss")))
__attribute__ ((aligned (32)))
static uint8_t lcd_fg_buffer[2][LCD_FG_WIDTH * LCD_FG_HEIGHT * 2];
static int lcd_fg_buffer_rd_idx;

static void SystemClock_Config(void);
static void CONSOLE_Config(void);
static void NPURam_enable(void);
static void NPUCache_config(void);
static void Display_NetworkOutput(uint32_t inference_ms);
static void Network_Postprocess(void);
static void Bubblesort(float *prob, int *classes, int size);
static void LCD_init(void);
static void Security_Config(void);
static void set_clk_sleep_mode(void);
static void IAC_Config(void);
static void Display_WelcomeScreen(void);
static void Hardware_init(void);
static void NeuralNetwork_init(uint32_t *nn_in_length, stai_ptr *nn_out, stai_size *number_output, int32_t nn_out_len[]);


/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{
  Hardware_init();

  /*** NN Init ****************************************************************/
  stai_size number_output = 0;
  stai_ptr nn_out[STAI_NETWORK_OUT_NUM] = {0};
  int32_t nn_out_len[STAI_NETWORK_OUT_NUM] = {0};

  {
    uint32_t nn_in_len = 0;
    NeuralNetwork_init(&nn_in_len, nn_out, &number_output, nn_out_len);
  }

  /* Warn if NOR flash is blank — weights at 0xFFFFFFFF produce NaN inference */
  if (*(volatile uint32_t *)0x71000004UL == 0xFFFFFFFFUL)
    printf("[ERROR] NOR flash blank - run: .\\flash.ps1 -Weights\r\n");

  /*** Post Processing Init ***************************************************/
  stai_network_info info;
  int ret;

  ret = stai_network_get_info(network_context, &info);
  assert(ret == STAI_SUCCESS);
  pp_input = nn_out_float;

  /*** Camera + LCD Init ******************************************************/
  uint32_t pitch_nn = 0;
  CameraPipeline_Init(&lcd_bg_area.XSize, &lcd_bg_area.YSize, &pitch_nn);
  LCD_init();
  CameraPipeline_DisplayPipe_Start(lcd_bg_buffer, CMW_MODE_CONTINUOUS);

  /*** Startup banner *********************************************************/
  printf("========================================\r\n");
  printf("MNIST Digit Classification - STM32N6570-DK\r\n");
  printf("Model : %s\r\n", STAI_NETWORK_ORIGIN_MODEL_NAME);
  printf("Build : %s %s\r\n", __DATE__, __TIME__);
  printf("========================================\r\n");

  /*
   * =========================================================================
   *  PIPELINE OVERVIEW
   * =========================================================================
   *
   *  IMX335 camera
   *    │  CSI-2 → DCMIPP (hardware scaler)
   *    ├─ Pipe 1 (continuous): full-res RGB565 → lcd_bg_buffer  (LCD preview)
   *    └─ Pipe 2 (snapshot):   32×32 RGB888  → nn_raw[3072]
   *
   *  nn_raw  uint8[32×32×3]  — raw camera pixels, one frame per inference
   *    │
   *    │  [CPU] Preprocessing — two passes over 1024 pixels
   *    │
   *    │  Pass 1: inverted grayscale
   *    │    gray = 0.299·R + 0.587·G + 0.114·B   (Rec.601 luma)
   *    │    val  = (255 − gray) / 255             (invert: ink→bright, paper→dark)
   *    │    → scan all pixels to find vmin and vmax
   *    │
   *    │  Pass 2: adaptive background suppression
   *    │    midpt    = (vmin + vmax) / 2
   *    │    hi_range = vmax − midpt
   *    │    v = 0.0                      if val ≤ midpt   (background → 0)
   *    │    v = (val − midpt) / hi_range if val > midpt   (digit → [0,1])
   *    │    Replicate v into R,G,B (model expects 3-channel float32 input).
   *    │    Rationale: simple min-max stretch amplifies uneven lighting in the
   *    │    background (vmin≈0.33–0.45 on white paper), pushing background pixels
   *    │    to ~0.3 after stretch and causing the classifier to see false structure
   *    │    (e.g. a "0" ring).  The midpoint threshold forces background to exactly
   *    │    0.0, matching the MNIST training distribution.
   *    │
   *    ▼
   *  nn_in   int8[32×32×3 = 3 072 bytes]  — model input (quantised, scale=1/255, zp=-128)
   *    │
   *    │  [NPU] Neural-ART CNN inference — mnist_cnn_32x32_aug_int8
   *    │        Weights in NOR flash @ 0x71000000  (<5 ms @ 1 GHz, 6/7 EC epochs)
   *    │
   *    ▼
   *  nn_out  int8[10]  — quantised output (scale=1/256, zp=-128)
   *    │
   *    │  [CPU] Dequantise → nn_out_float[10] in [0,1]
   *    │  [CPU] Postprocess: bubblesort → nn_ranking[] (highest prob first)
   *    │         threshold: reject if top-1 < 0.70
   *    │
   *    ▼
   *  LTDC layer 2  — classification results overlaid on camera preview
   *  USART1        — per-frame log at 115200 baud
   *    live mode : "[digit] confidence%  (Xms)"
   *    TEST_MODE : "digit=N  predicted=M  OK|WRONG  (Xms)"
   * =========================================================================
   */

  /*** App Loop ***************************************************************/
  while (1)
  {
    CameraPipeline_IspUpdate();

