andre1012345/STM32N6-digits-recognition/Application/Src/main.c
    /* --- [1] FRAME ACQUISITION --------------------------------------------- */
#if TEST_MODE
    /* Cycle through digits 0-9, advancing every DIGIT_HOLD_MS milliseconds */
    static int     current_digit   = 0;
    static uint32_t digit_start_ms = 0;
    if (digit_start_ms == 0) digit_start_ms = HAL_GetTick();
    if (HAL_GetTick() - digit_start_ms >= DIGIT_HOLD_MS)
    {
      current_digit  = (current_digit + 1) % 10;
      digit_start_ms = HAL_GetTick();
      printf("\r\n>>> Switching to digit %d <<<\r\n", current_digit);
    }
    memcpy(nn_raw, digits_table[current_digit], sizeof(nn_raw));
#else
#if DCMIPP_NN_NEEDS_CROP
    /* Start NN camera single capture Snapshot into intermediate buffer */
    CameraPipeline_NNPipe_Start(dcmipp_out_nn, CMW_MODE_SNAPSHOT);
#else
    /* Start NN camera single capture Snapshot into raw uint8 buffer */
    CameraPipeline_NNPipe_Start(nn_raw, CMW_MODE_SNAPSHOT);
#endif

    while (cameraFrameReceived == 0) {};
    cameraFrameReceived = 0;

#if DCMIPP_NN_NEEDS_CROP
    /*
     * Crop the image: the DCMIPP hardware requires output dimensions to be
     * multiples of 16, so we crop the padded buffer into nn_raw.
     */
    SCB_InvalidateDCache_by_Addr(dcmipp_out_nn, sizeof(dcmipp_out_nn));
    img_crop(dcmipp_out_nn, nn_raw, pitch_nn, STAI_NETWORK_IN_1_WIDTH, STAI_NETWORK_IN_1_HEIGHT, STAI_NETWORK_IN_1_CHANNEL);
#else
    /* Invalidate dcache for the DMA-written nn_raw before CPU reads it */
    SCB_InvalidateDCache_by_Addr(nn_raw, sizeof(nn_raw));
#endif
#endif /* !TEST_MODE */

    uint32_t ts[2] = { 0 };

    /* --- [2] PREPROCESSING: RGB888 uint8 → int8 (scale=1/255, zp=-128) ---
     * Same two-pass algorithm; output written as int8 to match the quantised
     * model input format (STAI_FORMAT_S8) generated by STEdgeAI. */
    {
      const uint8_t *src = nn_raw;
      int8_t        *dst = (int8_t *)nn_in;
      int n = STAI_NETWORK_IN_1_WIDTH * STAI_NETWORK_IN_1_HEIGHT;

      /* Pass 1: find scene vmin/vmax */
      float vmin = 1.0f, vmax = 0.0f;
      for (int i = 0; i < n; i++)
      {
        float gray = 0.299f * src[3*i] + 0.587f * src[3*i+1] + 0.114f * src[3*i+2];
        float val  = (255.0f - gray) / 255.0f;
        if (val < vmin) vmin = val;
        if (val > vmax) vmax = val;
      }

      float midpt    = (vmin + vmax) * 0.5f;
      float hi_range = vmax - midpt;
      if (hi_range < 0.005f) hi_range = 0.005f;

      /* Pass 2: suppress background, quantise to int8 */
      for (int i = 0; i < n; i++)
      {
        float gray = 0.299f * src[3*i] + 0.587f * src[3*i+1] + 0.114f * src[3*i+2];
        float val  = (255.0f - gray) / 255.0f;
        float v = (val <= midpt) ? 0.0f : (val - midpt) / hi_range;
        if (v > 1.0f) v = 1.0f;
        dst[3*i] = dst[3*i+1] = dst[3*i+2] = (int8_t)((int)(v * 255.0f) - 128);
      }
      SCB_CleanInvalidateDCache_by_Addr(nn_in, STAI_NETWORK_IN_1_SIZE_BYTES);
    }

    /* --- [3] NPU INFERENCE ------------------------------------------------- */
    ts[0] = HAL_GetTick();
    ret = stai_network_run(network_context, STAI_MODE_SYNC);
    assert(ret == 0);
    ts[1] = HAL_GetTick();

    /* Invalidate DCache so CPU sees the NPU-written nn_out values */
    for (int i = 0; i < (int)number_output; i++)
      SCB_InvalidateDCache_by_Addr(nn_out[i], nn_out_len[i]);

    /* Dequantise int8 output → float probabilities (scale=1/256, zp=-128) */
    {
      const int8_t *raw_out = (const int8_t *)nn_out[0];
      for (int i = 0; i < NB_CLASSES; i++)
        nn_out_float[i] = ((int)raw_out[i] + 128) * (1.0f / 256.0f);
    }

    /* --- [4] POSTPROCESS + DISPLAY ----------------------------------------- */
    Network_Postprocess();

    Display_NetworkOutput(ts[1] - ts[0]);

#if TEST_MODE
    printf("digit=%d  predicted=%d  conf=%.0f%%  %s  (%lums)\r\n",
           current_digit, nn_ranking[0],
           nn_top1_output_class_proba * 100.0f,
           (nn_ranking[0] == current_digit) ? "OK" : "WRONG",
           ts[1] - ts[0]);
#else
    printf("[%d] %.0f%%  (%lums)\r\n",
           nn_ranking[0],
           nn_top1_output_class_proba * 100.0f,
           ts[1] - ts[0]);
#endif

    /* Discard nn_out region (used by pp_input and pp_outputs variables) to avoid Dcache evictions during nn inference */
    for (int i = 0; i < number_output; i++)
    {
      void *tmp = nn_out[i];
      SCB_InvalidateDCache_by_Addr(tmp, nn_out_len[i]);
    }
  }
}


static void Hardware_init(void)
{
  /* Power on ICACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_ICACTIVE_Msk;

  /* Set back system and CPU clock source to HSI */
  __HAL_RCC_CPUCLK_CONFIG(RCC_CPUCLKSOURCE_HSI);
  __HAL_RCC_SYSCLK_CONFIG(RCC_SYSCLKSOURCE_HSI);

  HAL_Init();

  SCB_EnableICache();

#if defined(USE_DCACHE)
  /* Power on DCACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_DCACTIVE_Msk;
  SCB_EnableDCache();
#endif

  SystemClock_Config();

  CONSOLE_Config();
  printf("\r\n[HW] UART OK\r\n");

  NPURam_enable();
  printf("[HW] NPU RAM OK\r\n");

  Fuse_Programming();
  printf("[HW] Fuse OK\r\n");

  NPUCache_config();
  printf("[HW] NPU Cache OK\r\n");

  /*** External RAM and NOR Flash *********************************************/
  BSP_XSPI_RAM_Init(0);
  BSP_XSPI_RAM_EnableMemoryMappedMode(0);
  printf("[HW] XSPI RAM OK\r\n");

  BSP_XSPI_NOR_Init_t NOR_Init;
  NOR_Init.InterfaceMode = BSP_XSPI_NOR_OPI_MODE;
  NOR_Init.TransferRate = BSP_XSPI_NOR_DTR_TRANSFER;
  BSP_XSPI_NOR_Init(0, &NOR_Init);
  BSP_XSPI_NOR_EnableMemoryMappedMode(0);
  printf("[HW] XSPI NOR OK\r\n");

  /* Set all required IPs as secure privileged */
  Security_Config();

  IAC_Config();
  set_clk_sleep_mode();

}

static void NeuralNetwork_init(uint32_t *nn_in_length, stai_ptr *nn_out, stai_size *number_output, int32_t nn_out_len[])
{
  stai_network_info info;
  int ret;

  /* initialize runtime */
  ret = stai_runtime_init();
  assert(ret == STAI_SUCCESS);
  /* init model instance */
  ret = stai_network_init(network_context);
  assert(ret == STAI_SUCCESS);

  ret = stai_network_get_info(network_context, &info);
  assert(ret == STAI_SUCCESS);
  assert(info.n_inputs == 1);
  *number_output = STAI_NETWORK_OUT_NUM;

  /* Get the input buffer size & address */
  *nn_in_length = info.inputs[0].size_bytes;
  ret = stai_network_get_inputs(network_context, &nn_in, (stai_size *)&info.n_inputs);
  assert(ret == STAI_SUCCESS);

  /* Get the output buffers size & address */
  ret = stai_network_get_outputs(network_context, nn_out, number_output);
  assert(ret == STAI_SUCCESS);
  for (int i = 0; i < *number_output; i++)
  {
    nn_out_len[i] = info.outputs[i].size_bytes;
  }
}

static void NPURam_enable(void)
{
  __HAL_RCC_NPU_CLK_ENABLE();
  __HAL_RCC_NPU_FORCE_RESET();
  __HAL_RCC_NPU_RELEASE_RESET();

  /* Enable NPU RAMs (4x448KB) */
  __HAL_RCC_AXISRAM3_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM4_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM5_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM6_MEM_CLK_ENABLE();
  __HAL_RCC_RAMCFG_CLK_ENABLE();
  RAMCFG_HandleTypeDef hramcfg = {0};
  hramcfg.Instance =  RAMCFG_SRAM3_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM4_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM5_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM6_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
}

static void set_clk_sleep_mode(void)
{
  /*** Enable sleep mode support during NPU inference *************************/
  /* Configure peripheral clocks to remain active during sleep mode */
  /* Keep all IP's enabled during WFE so they can wake up CPU. Fine tune
   * this if you want to save maximum power
   */
  __HAL_RCC_XSPI1_CLK_SLEEP_ENABLE();    /* For display frame buffer */
  __HAL_RCC_XSPI2_CLK_SLEEP_ENABLE();    /* For NN weights */
  __HAL_RCC_NPU_CLK_SLEEP_ENABLE();      /* For NN inference */
  __HAL_RCC_CACHEAXI_CLK_SLEEP_ENABLE(); /* For NN inference */
  __HAL_RCC_LTDC_CLK_SLEEP_ENABLE();     /* For display */
  __HAL_RCC_DMA2D_CLK_SLEEP_ENABLE();    /* For display */
  __HAL_RCC_DCMIPP_CLK_SLEEP_ENABLE();   /* For camera configuration retention */
  __HAL_RCC_CSI_CLK_SLEEP_ENABLE();      /* For camera configuration retention */

  __HAL_RCC_FLEXRAM_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM1_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM2_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM3_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM4_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM5_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM6_MEM_CLK_SLEEP_ENABLE(); 

